In [1]:
import numpy as np
import pandas as pd

In [2]:
leisure = pd.read_csv('../alt_data/target_data/target_leisure_hospitality.csv')

In [3]:
leisure.head()

         DATE  USLAH
0  1939-01-01   1860
1  1939-02-01   1867
2  1939-03-01   1877
3  1939-04-01   1887
4  1939-05-01   1888

In [4]:
leisure.rename(columns={'USLAH':'target_leisure_hospitality'}, inplace=True)

In [5]:
leisure['DATE'] = pd.to_datetime(leisure['DATE']).dt.to_period('M')

In [6]:
leisure.set_index('DATE', inplace=True)
leisure.head()

         target_leisure_hospitality
DATE
1939-01                        1860
1939-02                        1867
1939-03                        1877
1939-04                        1887
1939-05                        1888

In [7]:
# leisure.to_csv('../alt_data/leisure_data.csv')